{
  "ID": "44",
  "post_author": "130",
  "post_date": "2004-10-26 00:58:28",
  "post_date_gmt": "2004-10-26 04:58:28",
  "post_content": "So I haven't had any life changing events happen this week (which is probably a good thing). Actually, only one significant thing happened but I'll tell you about that later (huh?). One ordinary thing I did was read a book, a very good book in fact, though since its SciFi you probably have to like that stuff to enjoy it.\r\n\r\nIts been a while since I've read any fiction (excluding the multiple readings of LOTR in the past 4 or 5 years) and when a friend of mine handed me <em>Ender's Game</em> I figured it would be a good way to waste some time other than computer stuff, video games, and such. I'm not in the SciFi book circles so this book was new(ish) to me, but it seems like it is quite a popular book. Bestseller, awards, mentioned on Slashdot all the time, yadda, yadda. I think that the reason I enjoyed it so much was that it was not science fiction for science fictions sake only. Rather, it was a complelling story which just happens to be set in a futuristic world. It certainly does have aliens, anti-gravity, and space-ships, but more importantly it has Ender. Such a poor yet amazing little kid. The book really makes you feel for him.\r\n\r\nI wouldn't classifly the book as having super-deep themes and philosophical insights, but I also would not classify it as superficial. There is some good questions there about children, how we treat them, and how we shape them, yet for the most part it an interesting and engaging story.\r\n\r\nYou can only read so many serious things right? Have some fun... ",
  "post_title": "Latest Book",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "latest-book",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-10-26 00:58:53",
  "post_modified_gmt": "2004-10-26 04:58:53",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=44",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "5"
}
