{
  "ID": "128",
  "post_author": "130",
  "post_date": "2005-10-15 15:29:50",
  "post_date_gmt": "2005-10-15 20:29:50",
  "post_content": "![51385754][small][] As I've been thinking of productivity, efficiency, procrastination, and laziness recently (and I still haven't gotten around to reading <a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0142000280/104-3367414-0941565?v=glance\">that book</a> yet) I've come to realize that I'm making things harder by worrying so much. It is obvious that trying to make yourself productive by worrying about it constantly only suffices to waste time that you could have used to actually do work. Yet I rarely notice that this is exactly what I'm doing -- and moreover I think that the previous assertion only just scratches the surface.\r\n\r\nSo the first step is admitting that you have a problem, right? I certainly am the type that constantly is calculating my time and what I can do to promote better usage of my time. The funny thing is that after calculating and forecasting I barely ever end up actually making productive use of any of it. My prime example is that I normally set my alarm every day since I can't let myself sleep in and waste that precious extra hour I could be using to do something. And guess what happens with that extra hour?\r\n\r\nI think the root of the problem is that by worrying in advance, I'm already making negative associations in my mind with a task/project. I'm making myself feel guilty already and by the time I sit down to get started, I react against that guilt and end up feeling more compelled to <em>not</em> do it. Wasn't the whole point to help myself get things done in the first place?\r\n\r\nFortunately I don't often get into this cycle during my day job (probably since there are so many other external motivating factors at work, such as career development, gaining respect from peers and management, and money -- or lack thereof if fired).  But for everything else, errands, chores, projects, coding, artwork, and unfortunately socializing, I do (some to a greater or lesser extent though).\r\n\r\nThe plan is to almost force myself to waste time, in order to make myself better utilize that time. (A better idea is probably to just have more things to do so that I just fit in what I want to do when I can. I bet making myself more busy will make myself a heck of a lot more productive).\r\n",
  "post_title": "Laziness...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "laziness",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-10-15 15:32:39",
  "post_modified_gmt": "2005-10-15 20:32:39",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=128",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "3"
}
