{
  "ID": "23",
  "post_author": "130",
  "post_date": "2004-07-23 01:54:51",
  "post_date_gmt": "2004-07-23 05:54:51",
  "post_content": "I can finally say that I've been to a club now, but I don't think I've been missing much.  I was at Avalon tonight with the EB interns for thursday college night (there are still a few interns here that are not over 21). I had pictured clubbing as being <em>atleast somewhat similar</em> to my prior dancing experineces (high school, weddings, ...) but that is certainly not the case. My impression of clubbing is the following. Girls go out on the floor by themselves, in their girl-huddles. Guys go up to a girl, grab them, and proceed to \"grind\", basically performing primitive pelvis shaking motions in close quarters.  So for a guy like me who would rather dance with someone and not act like I'm having sex with a stranger, things don't work so well.\r\n\r\nMaybe I shouldn't count clubs completely out now, but I think that it will be essential to go with a group in the future. And when I say group, I mean that there needs to be roughly the same amount of girls and guys. Tonight we had 8-9 guys and two girls... small problem. In an attempt to be courtious/brave/outgoing, a friend of mine and I went our own way in attempt to try and give those two girls a bit more room. As you can see above, I wasn't really very successful. I was lucky enough for a girl to come to me a twice. Unfortuntely for one of them I thought girl was mocking the way I was dancing. And for the other, I didn't recriprocate any \"grinding\" and was quickly left.\r\n\r\nI guess there is not much room for good old clean fun anymore.",
  "post_title": "Clubbing",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "clubbing",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-07-23 01:57:44",
  "post_modified_gmt": "2004-07-23 05:57:44",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=23",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "7"
}
