{
  "ID": "118",
  "post_author": "130",
  "post_date": "2005-07-31 00:53:05",
  "post_date_gmt": "2005-07-31 05:53:05",
  "post_content": "Very interesting stuff. Since I'm too lazy to extensively respond, I'll try to make this quick.\r\n<em>Lol, nevermind. This short comment on <a href=\"http://torrez.us/archives/2005/07/27/374\">Elias's blog</a> grew in to quite a long trackback.</em>\r\n\r\nAs a guy who caught onto the Semantic Web \"hype\" after people started to frown upon hearing the word, it bothers me how differently everyone defines the Semantic Web. Honestly, to me the Semantic Web has no direct baring to the RDF format. Although I think that having much more data published/presented/serviced in RDF will (greatly) help the promise of the Semantic Web become a reality, RDF does not have to be the enabling factor.\r\n\r\nYou could ask if I'm talking about RDF syntax (RDF/XML, N3, etc) or about the nature of RDF as a directed graph of relations between resources. I'd answer good question :). But really, I'm mostly saying that the syntax doesn't matter... I don't think I know enough to say whether the Semantic Web could come around with a drastically different knowledge model, but ya know maybe it could.\r\n\r\nSo what exactly do I think the Semantic Web means? I'm going to have a hard time pinning it down, but I'll try my best. To me the Semantic Web is all about taking the \"next step\" for the web. The web has gone through many of these \"steps\" such as moving from static pages to dynamic ones and the growth of web services. Both of these things took time to happen (and I'm sure the technologies to do them were around way before they became mainstream), but they were big improvements in the functionality and range of possibilities that the web could offer previously.\r\n\r\nI'm hoping that this \"nest step\" will help bring together all the wonderful knowledge and services that the web offers. Some of you will go, \"Oh you are talking integration BS like a marking person or something.\" And maybe someone would say, \"You already can integrate websites and services now. Just break out your &lt;insert favorite language&gt; do some SOAP/XML/REST/screen scraping and you're done!\"\r\n\r\nTo both I would say guilty as charged. For the first, I think that you need to give more credit to the marketing guys. Its true that marketing types and hypes can get ahead of themselves, but really people want things integrated. They want things to JUST WORK! Why should the user have to understand two different formats, two different applications, two different whatevers to actually get one thing done!? Integration is all about making things more intuitive and seamless for the user.\r\n\r\nFor the second, yea you are right. Developers can relatively simply do those things to bring together disparate information and services on the web. But that's the problem, you (most of the time) need to be a developer. Is that good enough? No. Imagine a world where everyday users can pull together web info which would currently require a developer to do. Ya know that really sweet <a href=\"http://www.housingmaps.com/\">website/webservice</a> that put <a href=\"http://www.craigslist.org/\">craigslist</a> stuff on a <a href=\"http://maps.google.com/\">Google Map</a>? (Well if you don't know, its quite freaking awesome) Anyways, it took some coder with some very bright ideas and swank javascript skills to pull that off. What if a normal user could do this easily by just browsing craigslist and google maps and just ask the browser to \"connect\" the data from both?\r\n\r\nYes that kind of functionality is pretty far off, but that is what the Semantic Web is all about. If you think that I'm wacky to think of the \"browser\" doing this, well then go and play with <a href=\"http://haystack.lcs.mit.edu/\">Haystack</a> and checkout what a Semantic Web browser could be like. Haystack is still very much a work in progress (at least since I was last involved a year ago) but the \"browser paradigm\" it is pushing could possibly enable that functionality in the future.\r\n\r\nSo where are we now? I don't think I really know very well, but interesting things are happening with RSS/ATOM, RDF, things like Haystack, and all the talk about REST web services. I'm sure that there are many many more cool things pushing in the Semantic Web direction that I don't know about, but hey -- I haven't been thinking about this stuff for a while (so gimme a break :) ).\r\n\r\nWhew, I hope that some of this made sense.\r\n",
  "post_title": "The Semantic Web...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "the-semantic-web",
  "to_ping": "",
  "pinged": "http://torrez.us/archives/2005/07/27/374/trackback/\nhttp://torrez.us/archives/2005/07/27/374",
  "post_modified": "2005-07-31 01:02:17",
  "post_modified_gmt": "2005-07-31 06:02:17",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=118",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
