{
  "ID": "115",
  "post_author": "130",
  "post_date": "2005-07-13 22:15:05",
  "post_date_gmt": "2005-07-14 03:15:05",
  "post_content": "So I've been in Mass. for a few weeks now and getting settled in the new apartment and with the new job. Since I've waited too long to write about this stuff, I'll skim the top by saying that things are going well, actually very well. Honestly, I really have not had the oppurtunity to actually get involved into work yet at all, but that will be started soon (and dorkily, I can't wait to dive in). \r\n\r\nIf you are interested in what I'm doing at IBM, <a href=\"http://domino.watson.ibm.com/cambridge/research.nsf/242252765710c19485256979004d289c/82869318e9f8f90385256cb80054bfb2?OpenDocument\">here's a paper</a> that describes the research prototype that our product implementation is based upon.  To some it may be a bunch of jargon and buzzwords, but really guys this could be big deal. The electronic forms of communication used alongside the wonderful widespread network we call the Internet have caused amazing strides in productivity, but they have not really changed to keep up with the times. I don't mean to say that email, im, etc are outdated at all, but the manner in which we are using these technologies has arguably become more of a hindrance than benefit in some cases (this point is being made from business/enterprise perspective and not necessarily a home user). For many, keeping track of their extensive and varied electronic communication and growing email volume is quite a daunting task. IBM is working on this problem by shifting the collaboration pardigm from being application-centric (as in email, im, etc is separe and non-integrated) to being activity centric (think of having activities which you attach various collobartive elements to). But to cut myself off before I start rambling on, I'm excited about it (ya think?).\r\n\r\nIn other news, since moving into the apartment I've already gotten an itch to build/fix up something, so I'be built.. well I don't know exactly what I should call it but it involves 23 one foot cubed organizing units (the ones you get from Target, actually 8 pairs of cubes and one 3x3 set of cubes), a few 8 foot long 2x6s, and plenty of screws. That probably makes no sense at all, a picture will help (when I get back).\r\n\r\nThat brings me to my next topic, I'm actually not at my apartment right now but in an IBM new hire orientation in Armonk, NY. This is the same place I got to stay <a href=\"http://www.timmfin.net/?p=27\">last summer</a> for Extreme Blue and boy, IBM sure does know how to wine and dine. So I'm being spoiled with a personal hotel room, gourment food, and time for pool, foosball, and ping-pong. And you guys told me that work was hard... :)",
  "post_title": "The real world as an IBMer...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "the-real-world-as-an-ibmer",
  "to_ping": "",
  "pinged": "\nhttp://www.timmfin.net/?p=27",
  "post_modified": "2005-07-13 22:15:54",
  "post_modified_gmt": "2005-07-14 03:15:54",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=115",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
