{
  "ID": "120",
  "post_author": "130",
  "post_date": "2005-09-08 23:06:10",
  "post_date_gmt": "2005-09-09 04:06:10",
  "post_content": "<em>Edit: I'm not perfect happy with myself for writing this post, but I feel obligated to keep it. I'm not changing my opinion, but I really should have been less direct and less judgemental. I like to think that I'm normally pretty good about trying to express my opinions as just that -- options. But it seems like I didn't do that so well this time. I apologize if I offended anyone. This is obviously a touchy topic for me, though it really is not something I worry about that often. As my mom commented, why the heck do I worry about these things so much? I don't have a good answer to that, but its something I should certainly think about.</em>\r\n\r\n\"Our ability to be intelligently unintelligent never ceases to astound me\" -- <a href=\"http://www.timmfin.net/chris/?p=16\">Chris Hayden</a>\r\n\r\nWell said -- there are no disagreements here. One tidbit I'd like to add is that Evolution and Creationism are not contradictory ideas (in my perspective). They only become contradictory when one takes the language from Genesis literally (and pushing fundamentalist I would add).\r\n\r\nLet me break out my bible (whew, its been a while!). The rest of you can read at the <a href=\"http://www.biblegateway.com/passage/?search=Genesis%20;&version=31;\">Bible Gateway</a> if you so desire.\r\n\r\nSo there are three main issues here (or three obvious issues that I think are the most prevalent). The length of God's creation work, the creation of Adam from \"the dust of the ground\" (Genesis 1:7), and the creation of Eve from Adam's rib.\r\n\r\nThe basic, basic evolutionary story is just that life started out as simple singular celled organisms in the ocean that eventually (aka billions of years) evolved in to all the biological diversity we have today. If you take the six days of creation as metaphoric/artistic symbolism Genesis's language does agree that God made life sequentially and gradually both beliefs can coexist peacefully. I also remember reading somewhere that the the original Hebrew word used there for \"day\" did not necessarily connote the literal \"day\" that we think of (maybe someone with more motivation and better memory can provide more info).\r\n\r\nNow some of you may say that I totally glazed over the \"metaphoric/artistic\" point, and yes I did. The reason being that it is quite involved to eloguently argue why the Bible should be taken from a more artistic, more <em>storylike</em> perspective (aka above my ability) . So instead I'll be blunt. Look, life isn't simple. As modern humans we ask lots of questions and want answers. Things are easier when the answers are given to us verbatim, and many people want to make the Bible an answer book since that would be nice and convenient (and make life simple, careless, <strong>and absolutely boring</strong>). If the Bible was an answer book then it wouldn't be so freaking complex and it would actually give answers (most of the time it only makes me ask more questions).\r\n\r\nThe Bible is not about the words (how many translations and versions are there?). It is about the experience. The experience of engaging in a search for knowledge and truth by following a compelling/artistic/historical/fictional/gruesome/intimate story.\r\n\r\nSince its late and I'm not motivated to write a long (well, longer I guess) theological rant, I won't say too much more. I would like to say that not a single person in the world takes the entire Bible literally. If you disagree with that statement, find me someone who follows all the of rules from <a href=\"http://www.biblegateway.com/passage/?book_id=3&chapter=2&version=31\">Leviticus</a> to the letter or someone that <a href=\"http://www.biblegateway.com/passage/?search=Mark%209:43-47;&version=31;\">cuts off their hands and feet</a>. The question is not whether you take the whole book/story literally or not, but rather if you tend to the more fundamental or more liberal part of the spectrum.\r\n\r\nWhew, the irony here is that this is coming from half-hearted Christian who has gone to church a handful of times in the past several months. Maybe I would be more motivated if I saw Christianity being more of a good thing in the world than another excuse for ignorance and bigotry.\r\n\r\nWhy don't all the Americans who are complaining about Fundamental Muslims see the proverbial plank in their own eye -- Fundamental Christianity? \r\n\r\nIts alright if they don't call me a Christian, I don't really want to be associated with them anyway...",
  "post_title": "Good quote! and response...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "good-quote-and-response",
  "to_ping": "",
  "pinged": "\nhttp://www.timmfin.net/chris/?p=16",
  "post_modified": "2005-09-10 19:09:46",
  "post_modified_gmt": "2005-09-11 00:09:46",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=120",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "16"
}
