{
  "ID": "86",
  "post_author": "130",
  "post_date": "2005-03-18 02:42:19",
  "post_date_gmt": "2005-03-18 07:42:19",
  "post_content": "<p>After all these years being single (last time I dated was some in Freshman year, though I tried once as a Sophomore) I think I'm actually missing being in a relationship. I think the majority of college I couldn't really be bothered to want to spend that much time trying to impress/get to know/develop a relationship with someone. I guess I never really had my socks knocked off between then and now...</p>\r\n\r\n<p>So I guess, here I am know moving off to place where I know practically no one, still clinging to the shyness of my youth, and I've had less dating experience than the average high schooler. Well maybe these are exaggerations, but still I feel like I don't know the \"rules of the game\".</p>\r\n\r\n<p>Sometimes I wonder how much easier life would be if I could just forget about morals, respecting females, and the rest of my overall up tightness. I'd sure have a good time, at least for a little bit... ahh, but that's not really an option for me anyways. I wouldn't even know how to start acting like someone other than myself.</p>\r\n\r\n<p>Here's to hoping Boston has plenty of interesting, beautiful, and open-minded women! And two, that I'd actually get the guts to talk to them.</p>\r\n\r\n<p><em>Note: I quite rarely talk to anyone except a few people about my personal life, not exactly sure why I'm writing this to a slightly larger audience now. Don't worry. I'm sure it won't happen again for quite some while.</em></p>",
  "post_title": "Relationships ...",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "relationships",
  "to_ping": "",
  "pinged": "\nArray\n",
  "post_modified": "2005-03-18 02:49:00",
  "post_modified_gmt": "2005-03-18 07:49:00",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=86",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "10"
}
