{
  "ID": "64",
  "post_author": "130",
  "post_date": "2005-01-13 16:05:18",
  "post_date_gmt": "2005-01-13 21:05:18",
  "post_content": "<p>While I was catching up on reading several new Christian(ish) blogs I've subscribed to, I came across this wonderful <a href=\"http://scjtoday.typepad.com/scjtoday/2005/01/_today_my_wife_.html\">post</a> on the combativeness that Christians have toward the increasing secularism of today's culture. It's about the possible removal of prayer during the inaugration.</p>\r\n\r\n<p>Today, Christians are very willing to be hostile toward anything the government or corporations do which infringe the Christian \"norm\" (for lack of a better word). (Note: yes, hostile is a bit excessive but I need something more than critical and defensive). Most of these things revolve around prayer, sex, marriage, homosexuality, and so on. Its seems that most Christians have been habituated in to thinking that action against any Christian belief/practice is a bad thing. And yes, I do mean to associate this to bells and saliva, since I think this ideology is more instinctual than intellectual.</p>\r\n\r\n<p>Anyways, I don't think I have all my thoughts together to talk about this yet. I'm glad that this person chose to be \"rebellious\" and help people understand that their instinct and motivation may be (or the seed of it at least) in the right place, but that is only part of our mind and rarely emotions alone come to the correct conclusion. And still I think that is only the beginning of the real point here. Is the government a better blessing to the world being superficially spiritual or earnestly loving? Even more so, does the worry about maintaining public displays of spirituality actually degrade the kind of spirituality we should really be seeking?</p>",
  "post_title": "Combating Christian defensiveness",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "combating-christian-defensiveness",
  "to_ping": "",
  "pinged": "\nhttp://scjtoday.typepad.com/scjtoday/2005/01/_today_my_wife_.html",
  "post_modified": "2005-01-13 16:12:24",
  "post_modified_gmt": "2005-01-13 21:12:24",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=64",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "1"
}
