{
  "ID": "164",
  "post_author": "130",
  "post_date": "2007-08-13 00:26:10",
  "post_date_gmt": "2007-08-13 05:26:10",
  "post_content": "<p style=\"\">\r\n  Its been two years in at IBM, so that is about time for the \"<strong>I</strong>'ve <strong>B</strong>een <strong>M</strong>oved\" pseudonym to take affect. Starting this past week (since I was on vacation the week prior) I left the yellow box plastered walls of Lotus and head to a group inside of the CIO office.\r\n</p>\r\n<p style=\"\">\r\n  The short of it is, I'm moving away from product development toward prototype/research development. Not research in the academic sense (though I did consider that), but research in the sense of experimenting, learning, and innovating.\r\n</p>\r\n<p style=\"\">\r\n  ... intermission\r\n</p>\r\n<p style=\"\">\r\n  Please remember that I'm not IBM, so these thoughts are 100% owned by Timothy J. Finley and not HAL^h^h^hIBM.\r\n</p>\r\n<p style=\"\">\r\n  ...And for the longer version (which has turned into quite a history lesson (more for my own archival purposes))\r\n</p>\r\n<p style=\"\">\r\n  At Lotus I've been working on the Activities project from the first day I started, but Activities has meant many different things over the past few years. I was originally inspired to join IBM to help work on the productization of the <a href=\"http://domino.research.ibm.com/cambridge/research.nsf/a1d792857da52f638525630f004e7ab8/82869318e9f8f90385256cb80054bfb2?OpenDocument\">Activity Explorer</a> research project (wahoo a new way to collaborate!). When I started the team was just releasing the preview of <a href=\"http://www-128.ibm.com/developerworks/lotus/library/ae/\">Activity Explorer in IBM Workplace</a>. </p>\r\n<p style=\"\">\r\n  But it wasn't very long before momentum started moving away from Activities as a traditional rich client application toward focusing on a web experience. This was great for me since I was one of the few people on the team that already had some web development skills. The period that followed was the best programming experience I've had so far in my life. We (me and my tech lead) were pumping out code left and right, righting decent tests, quickly getting a prototype usable, continually responding to feedback from use, and adding features all the time.\r\n</p>\r\n<!--nextpage-->\r\n<p style=\"\">\r\n  Although things started to slow down as the requirements came in, the team expanded, and more people (aka management) got involved — we kept up great momentum for a long time. More and more people were using our deployment for Real Business Work™ which was great, but also kinda scary since people were worried about losing data and peeved by downtime. Iterations went by and the UI got more refined as the designers cranked out their magic and features were tweaked. We even removed some features that were too complex (but we probably should have simplified even more).\r\n</p>\r\n<p style=\"\">\r\n  But things really started to slow down when managers started mentioning the devilish S-word... Ship. This rubber hit the road we had to ensure our i's were dotted and t's were crossed so we didn't shoot ourselves in the foot (no more idioms I swear!). Maybe those were details we actually forgot or \"chose\" to forget, but either way they needed fixing real soon now. </p>\r\n<p style=\"\">\r\n  By now I had earned more respect and responsibility on the team. Some of it was earned through hard work, some if it was being in the right place at the right time (I got the chance to try and fill in the shoes of a great senior developer we lost), and some of it was from just being a bold junior developer. But anyway... I had gotten to the point where I was doing my normal developer \"day job\", trying to lead a small team, and help out and do other various work here that was needed and was not getting done.\r\n</p>\r\n<p style=\"\">\r\n  This is where things started to get more complicated.\r\n</p>\r\n<p style=\"\">\r\n  One thing that sticks out (since it frustrated me to no end) was getting lured into to owning some part of the project. It starts out by hearing that there is some new or unforeseen feature or problem needs work. All developers are already fully assigned, but it has to get done. Next, someone with a bit initiative (aka guilty sucker) steps up and says, \"That isn't hard to implement. I can code it up.\"\r\n</p>\r\n<p style=\"\">\r\n  I have now since learned where that leads. By volunteering to do extra work you inevitably end up owning this work. In other words, you are on the hook to fix, support, and document the things you were being nice for doing in the first place! The funny thing is that no body ever asked you. The just assumed since you've already started it, you might as well do it all.\r\n</p>\r\n<!--nextpage-->\r\n<p style=\"\">\r\n  True, having to do extra work is a part of the job description to some extent, but I feel like I ended up doing it far too often. At the time I couldn't point my finger on exactly why this irked me so much, but later I realized that I simply felt like my generosity was used. It's one thing to help out and then be asked to own and continue working on it, but it is totally different to be forced into a commitment that you never committed to!\r\n</p>\r\n<p style=\"\">\r\n  Some of this was my own fault. Part of stepping up and taking on responsibility is realizing what you are getting yourself into and what you can handle. Little did I know how much things are different at the end of a product cycle compared to the beginning. Fortunately I got my way through it, and I have to admit I think I did a pretty good job. Especially considering that I was learning what a product cycle was like at the same time I was trying to lead through one. But unfortunately, I personally came out of it for the worse. I was getting burned out, feeling too responsible, and trying to do too much.\r\n</p>\r\n<p style=\"\">\r\n  But hey this is the real world, live and learn! I'm happy for all the good times and mostly happy for all the bad times too. Everyone could use/learn from a shakin' of their idealistic point of view from time to time.\r\n</p>\r\n<p style=\"\">\r\n  So now <a href=\"http://www-142.ibm.com/software/sw-lotus/products/product3.nsf/wdocs/connectionshome\">Connections</a> has shipped I'm now off and running with my new team, which is being (fastidio... err wildly :) ) lead by <a href=\"http://torrez.us/\">Elias Torres</a>. This has given me the   chance relax and try to more objectively look back at my two years at Lotus. I   still do think that many of my frustrations were valid, but I can't fault IBM   too much for that. Not only was I young and learning (the hard way), but  enterprise software development is hard to do. And trying to do something  innovative and enterprisy at the same time is even harder to do. There are  just so many details to worry about — configuration, security, databases,  ldaps, accessibility, localization, bidirectionality, integration, and most of all trying to appease the desires of waayy too many people — which ends up  washing out what is supposed to be the important part. Building quality  software that people want to use. </p>\r\n<p style=\"\">\r\n  So that is what I'm off to try and do. I now know that enterprise product development is not where I want to be, at least right now. I'm surprised so many people are just fine with that sort of job, but I have no interest to ride that roller coaster.\r\n</p>",
  "post_title": "Saying good bye to Lotus...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "164",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2007-08-13 10:33:00",
  "post_modified_gmt": "2007-08-13 15:33:00",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/2007/08/13/164/",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
