{
  "ID": "110",
  "post_author": "130",
  "post_date": "2005-06-14 22:35:55",
  "post_date_gmt": "2005-06-15 03:35:55",
  "post_content": "Yesterday we spent most of the day hiking around and driving up Pike's Peak. Tourists can access the pike via a touring train or car. We of course didn't want to take a glitzy train up to the top (it also required reservations) so instead we drove up 19 miles along Pike's Peak Highway to reach the summit.\r\n\r\nAs we entered the park we were told that the conditions at the peak were too dangerous and no visitors were allowed above the timberline. Fortunately by the time we go up to the 13th mile the Peak was reopened. I was driving on the way up and although I was slightly uneasy driving around the twists and turns of the lower part of the mountain, the rest of the mountain was a whole different story. Gone were the paved roads, surrounding trees, and guardrails… only narrow, climbing paths was sheer drops. Yippie. It really wasn't all that bad, but it definitely made me recollect the fear of heights that had not manifested itself for some time. Despite all of this, I'd have to say that the drive was still a good idea since there were many pull-off points along the way to jump out of the car and take pictures. \r\n  \r\nEventually we got to the top, and boy was it chilly… No, not chilly but really freaking windy and cold. At 14000ft (I don't remember the exact number) it was in the low thirties and with gusts bad enough to make you lose your balance. The views (360 deg of it) were spectacular, though it was a bit hazy. Also it was a bit more difficult to appreciate the sights when you are standing in the snow holding onto the freezing railing wearing shorts. Although Pete cowered back into the car after a few minutes (sry Pete I had to :)), I tried to stick it out and take all the pictures I could. Unfortunately, I think that I lost about half of those peak photos from a droplet of water that I didn't notice on my lens. The upside is that after taking 120 pictures from one mountain, you are bound to at least get a few good ones, right?\r\n\r\nThe drive back down (Pete behind the wheel this time) was thankfully uneventful, but we made sure to stop and take a few more pictures along the way. After that we heading to a campground near our next destination and lazed of the rest of the day (which for me was reading and resting). So far, the campgrounds we have stayed at have impressed me. When I was thinking \"campground\" before I had a very different picture in my mind. But, I certainly don't mind clean bathrooms,  laundry facilities, and cheap tasty breakfast. We ate well again, thanks to that little gas burner we brought along (thanks to Bruce/Bruce's dad). Nothing fancy, but sausage links and chunky soup sure does stick to the ribs :).\r\n\r\nOk, enough of yesterday. I woke up early to read along the riverside. Our campsite was only a hop and a skip away from the river (no jump though, that probably wouldn't be a good idea to do on those rocks) since the sound of the fast-moving current was amazingly soothing. The better-food-than-back-at-home trend continued with my world famous grilled egg and cheese sandwiches (well not exactly world famous, but good enough for me).\r\n\r\nToday we took a bit of a break from the picture-taking and touristy things to raft along the river that we sleep along the previous night (Arkansas river). I had been whitewater rafting once before in West Virginia, but I was hoping that today would be more exciting (ya know, more thrilling, more danger, longer waiver forms, etc). \r\n\r\nThe run we went on was an all day trip (well really only 9:30am to 4:00pm or so), but the more exciting stuff only happened in the second half of the day in the Royal Gorge. The rapids were certainly much better than the ones I had been on before, but unfortunately the crew in my boat did too well. We didn't have any \"OH $%&#\" experiences, likely due to the fact that we had a good guide and the six of us (all able-bodied guys) actually followed directions. Maybe some class V rapids (these were class IVs) will give me the thrill I'm looking for. But, it still was a lot of fun (though expensive). I certainly didn't mind the cute female guide :).\r\n\r\nAfter that it was time to get back on the road again. As we speak we're on in Utah I-70 making our way to Zion (about six hours in so far, probably another four to go). The views along route 50 earlier this afternoon/evening were spectacular. Particularly, my breath was taken away by the endless, green rolling hills carved by blue creeks and dotted with trees. It doesn't really have the same \"Wow, is that real?\" response as the impressive mountain/rock formations, but it is truly beautiful. \r\n",
  "post_title": "Real men don't need guard rails… ",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "real-men-don%e2%80%99t-need-guard-rails%e2%80%a6",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-06-18 01:27:32",
  "post_modified_gmt": "2005-06-18 06:27:32",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=110",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
