{
  "ID": "177",
  "post_author": "130",
  "post_date": "2008-06-06 15:01:15",
  "post_date_gmt": "2008-06-06 20:01:15",
  "post_content": "<style>\r\na.footnote {\r\nfont-size:85%;\r\nvertical-align:super;\r\nborder-bottom: none !important;\r\n}\r\n.flickr-wrapper-left {\r\nbackground-color:#FFFFFF;\r\nborder:1px solid #DDDDDD;\r\nfloat:left;\r\nmargin-bottom:10px;\r\nmargin-right:10px;\r\npadding:4px;\r\n}\r\n.flickr-wrapper-right {\r\nbackground-color:#FFFFFF;\r\nborder:1px solid #DDDDDD;\r\nfloat:right;\r\nmargin-bottom:10px;\r\nmargin-left:10px;\r\npadding:4px;\r\n}\r\n</style>\r\n\r\n<p id=\"fzdg0\"><i id=\"fzdg1\">A look back at our very (very!) memorable engagement weekend. It's long, so if you are lazy you can go directly to the <a id=\"t9um\" title=\"Lessons learned\" href=\"#lessons\">summary</a> and <a id=\"s:3z\" title=\"Engagement weekend flickr set\" href=\"http://flickr.com/photos/timmfin/sets/72157605354919216/\">pictures</a>.</i> </p>\r\n<p id=\"fzdg2\"><a id=\"obqg0\" title=\"DSC_0013 by timmfin, on Flickr\" href=\"http://www.flickr.com/photos/timmfin/2539491322/\"><img class=\"flickr-wrapper-left\" id=\"obqg1\" height=\"240\" alt=\"DSC_0013\" src=\"http://farm4.static.flickr.com/3107/2539491322_776c3d84e1_m.jpg\" width=\"159\"></a> </p>\r\n<p id=\"iar.0\">We started our Memorial Weekend hiking trip bright and early Saturday morning. After a quick stop at the information center, we parked, packed up our things and got out on the trail (around 9:30am). A few minutes in I realized I forgot my camera, so I ran back to the parking lot to grab it. I tried to run back up the trail, but that was a bad idea. Starting the hike completely winded wasn't helpful, especially because we were on the wrong trail<a class=\"footnote\"  href=\"#lesson1\">1</a>! We kept on wondering why the trail was so steep, and why the lake below was in the wrong place. After pouring over our map (thank you AMC guidebook!) we realized our error, but fortunately we were still going to the right destination (Cannon Mt). </p>\r\n<p id=\"iar.1\">So no biggie, we can handle 2000 ft of vertical in 2 miles, right? That was until we starting <a id=\"yy5g\" title=\"seeing snow\" href=\"http://flickr.com/photos/timmfin/2538668613/in/set-72157605354919216/\">seeing snow</a>. At first it was just little patches here and there, but eventually it covered the entire trail<a class=\"footnote\" href=\"#lesson2\">2</a>. I was getting worried. The trail is kicking our butts, it's cold, and we're trudging through snow (let me tell you, Cindy is not a fan of snow). I started second guessing whether I was going to do this or not. </p>\r\n<p id=\"iar.2\">Eventually we reached the summit. Well, it wasn't exactly the summit, but it was darn close and had a <a id=\"ifqt\" title=\"great view\" href=\"http://flickr.com/photos/timmfin/2538668989/in/set-72157605354919216/\">great view</a>. We took a break, soaked in the surroundings, <a id=\"hw4j\" title=\"snapped some pictures\" href=\"http://flickr.com/photos/timmfin/2539491546/in/set-72157605354919216/\">snapped some pictures</a>, and snacked a bit (anything I could use to stall and wait for the other couple up there to leave). When we were finally by ourselves I started getting really nervous. Cindy asked me if I was ready to get moving again (because she was probably freezing her butt off!), but convinced her to stay just a little bit longer. </p>\r\n<p id=\"iar.3\">So it was now or never. I built up my courage, took her hand, got down on one knee, and started my spiel (sorry, those words are for Cindy only). My heart was racing, but fortunately I had rehearsed it enough that (I think) I didn't make a complete fool of myself. I had hidden the ring inside the breast pocket of my jacket wrapped in tissues and my glove liners. After what seemed like an eternity of unpacking, I offered her the ring and said, \"Will you marry me?\" I can't remember the next minute very well, I think I was too wrapped up in my own excitement to even hear her response. I had to double check with her to make sure she said yes :) </p>\r\n<p id=\"iar.4\">After taking some time to celebrate, we got back on to the trail. It was only a short trip to the true summit, though we skipped the observation tower. We took a different route back down, which was the route that we were supposed to start out on. It was easier than before, but our legs were too wobbly to appreciate it. There was still some snow, but since we were coming down the other face of the mountain there were more puddles pools made from recently melted snow rather than the cold kind. </p>\r\n<p id=\"iar.5\">We had a happy trip down, though I still hadn't relieved myself of all my worry yet. For a long while I couldn't stop apologizing. I said I was sorry for the snow, sorry for the cold, sorry taking so long to propose at the summit, etc. It was supposed to be perfect! It took a little while, but she eventually knocked some sense in to me. None of that mattered. All that mattered was that we were now happily engaged! (And little did I know how many more \"imperfections\" were to come!) </p>\r\n<p id=\"iar.6\">When we reached the bottom of the mountain, we took another well deserved break. Refreshed by some more food and gatorade we set out on the flat and (supposedly) simple trail to go from where we should have parked to where we actually parked. It started off easily enough, but then the trail stopped. The map showed the trail following the left edge of a lake, but all we could see were the remnants of a few small bridges... which were inconveniently floating in the middle of the lake. No biggie, there was a bike road we intersected with a few minutes back, we'll just follow that back to the parking lot instead of the trail. </p>\r\n<p id=\"iar.7\">Full of pride from our showing of dexterity on the earlier pools of melted snow, I figured we could shortcut things by crossing a creek and plowing through a bit of forest -- instead of walking a few minutes. That wasn't a good idea<a class=\"footnote\" href=\"#lesson3\">3</a>. I was looking very fleet and nimble, until I lost my footing on a rock. I only ended up soaking one foot (I'd say a pretty good recovery), but we still had about another mile to go. Squish. Squish. </p>\r\n<p id=\"iar.8\">Wearily we made it back to the car (and a got to finally take those wet socks off!). Earlier I had let Cindy in on another secret I had for the weekend. Instead of camping Saturday night, we had a room at the <a id=\"iedb\" title=\"Woodstock Inn Station &amp; Brewery\" href=\"http://www.woodstockinnnh.com/\">Woodstock Inn Station &amp; Brewery</a>. And it was no simple room either. We had a King bed, sofa, whirlpool jacuzzi, fireplace, and a refridgerator to cool the champagne I bought. So we had so time to relax (aka nap), sip champagne, and sooth our muscles before dinner. </p>\r\n<p id=\"iar.9\">We ate at the Clement Room Grille and boy, what a meal. I had a filet with scallops, crabmeat, and hollandaise sauce and Cindy had smoke grilled salmon glazed with butter and New Hampshire maple syrup. Fantastic. We topped it off with Mouse Tracks pie for desert which was also excellent, but stuffed ourselves so much that we couldn't stop by the bar afterward and try our their microbrew. Bummer, we'll have to go back someday :). </p>\r\n<p id=\"iar.10\">When I woke up in the morning, I had completely forgotten to dry my hiking boots out. So as we were getting ready and using the last of the champagne for mimosa, I stuffed the shoes with paper towels and set up an apparatus with the shoes and a clothes hanger to keep them nice and close to the fire. We headed off to breakfast, casting a wary glance at the fireplace, but pretty confident that leaving the fire on for a hour or so would be fine (it was a gas fireplace after all). But when we got back from yummy waffles and french toast, something was definitely wrong. The room smelled awful and it didn't take long to notice the malformed shoes by the fire<a class=\"footnote\" href=\"#lesson4\">4</a>. </p>\r\n<p id=\"iar.11\">This was a problem. I was up for attempting to wear the something-boot-esqe things, but Cindy would have none of it (she was definitely right). When we checked out, we got directions to a few local places where we might find hiking shoes. Thankfully, a ski shop nearby did the trick. The boots were a bit expensive, but they fit. </p>\r\n<a id=\"h3ka0\" title=\"There it was! by timmfin, on Flickr\" href=\"http://www.flickr.com/photos/timmfin/2539495124/\"><img class=\"flickr-wrapper-right\" id=\"h3ka1\" height=\"240\" alt=\"There it was!\" src=\"http://farm3.static.flickr.com/2208/2539495124_253487b4dc_m.jpg\" width=\"190\"></a> \r\n<p id=\"iar.12\">We eventually got to the trail head around 10:30am. We were a bit frazzled, but confident that our weekend was back on track. This time we were doing the Franconia Ridge Loop, which leads you over two 4000 footers (<a id=\"nt_e\" title=\"Lincoln\" href=\"http://flickr.com/photos/timmfin/2538670049/in/set-72157605354919216/\">Lincoln</a>  and <a id=\"cbq7\" title=\"Lafayette\" href=\"http://flickr.com/photos/timmfin/2538670381/in/set-72157605354919216/\">Lafayette</a> ). This hike wasn't quite as exciting as the previous one (you can only propose once, I guess) , but it had some absolutely <a id=\"nh-b\" title=\"stunning views\" href=\"http://flickr.com/photos/timmfin/2538670135/in/set-72157605354919216/\">stunning views</a>  from the <a id=\"dyzp\" title=\"ridge\" href=\"http://flickr.com/photos/timmfin/2539493264/in/set-72157605354919216/\">ridge</a>. It was such a beautiful, clear day! We even had a great view of the cliff I proposed from. Cindy is pointing at it in the picture :).</p>\r\n<p id=\"iar.12\">The hike up to, and across the ridge was a good workout, but not too bad. The way down was another story. There was more <a id=\"kvly\" title=\"snow\" href=\"http://flickr.com/photos/timmfin/2538671737/in/set-72157605354919216/\">snow</a>. Lots more snow. We thought treking up a steep snowy incline was hard -- going down is much harder! We spent 45 minutes <span class=\"Apple-style-span\" id=\"m__90\"><strike id=\"xpu40\">attempting to walk</strike></span> sliding down from the top of the Falling Waters trail. Next time we'll bring hiking poles<a class=\"footnote\" href=\"#lesson5\">5</a> -- boy would they have helped (instead of trying to <a id=\"wbsz\" title=\"make our own\" href=\"http://flickr.com/photos/timmfin/2539494426/in/set-72157605354919216/\">make our own</a>).</p>\r\n<p id=\"iar.12\">It wasn't just the snow. The Falling Waters trail has that name for a reason, and not from the snow we slipped and fell on. The name comes from the several <a id=\"k20m\" title=\"creeks\" href=\"http://flickr.com/photos/timmfin/2539495246/in/set-72157605354919216/\">creeks</a> and <a id=\"c71:\" title=\"waterfalls\" href=\"http://flickr.com/photos/timmfin/2538672827/in/set-72157605354919216/\">waterfalls</a> that criss-cross the trail. As you know, I already had some trouble fording a creek the day before, but this time it was Cindy's turn. She did it in grand style, practically face-planting into the water. For better or worse, a couple rocks prevented her from getting soaked -- though they gave her some pretty good bruises<a class=\"footnote\" href=\"#lesson3\">3</a>. That last leg of the loop did us in (definitely harder than yesterday), but we made it down and it was so worth it!</p>\r\n<p id=\"iar.12\">We were worried about it getting cold, but decided camp for the night anyway. After some McGyver problem solving<a class=\"footnote\" href=\"#lesson6\">6</a>, fun with fire, yummy campfire food, and Cindy's bout with the wet wipes<a class=\"footnote\" href=\"#lesson7\">7</a> we called it a night. The next morning we heading back to town, leaving NH with some great memories<a class=\"footnote\" href=\"#lesson8\">8</a> and looking forward to spending the rest of our lives together :).</p>\r\n<p id=\"iar.12\"> </p>\r\n<div id=\"iar.14\" style=\"CLEAR: both\"><strong><a id=\"bcjk0\" name=\"lessons\" style=\"text-decoration: none; border-bottom: none;\">Lessons Learned</a></strong>\r\n<ol id=\"iar.16\" style=\"margin-left: 3em\">\r\n<li id=\"lesson1\">Make sure to start on the right trail. A map might help figure out your bearings, but it won't help you with the more more difficult trail you are already halfway though. \r\n</li>\r\n<li id=\"lesson2\">Hiking in May means snow. Not just little patches of snow but <a id=\"f-s3\" title=\"three-feet-packed-hope-your-leg-doesn't-fall-through\" href=\"http://flickr.com/photos/timmfin/2538668235/in/set-72157605354919216/\">three-feet-packed-hope-your-leg-doesn't-fall-through</a>  kind of snow. \r\n</li>\r\n<li id=\"lesson3\">Little creeks and waterfalls should not be under-estimated. The can easily soak and bruise you. \r\n</li>\r\n<li id=\"lesson4\">Fireplaces make excellent hiking-boot-dryers. They also make even better hiking-boot-melters. One makes nice toasty dry shoes and the other makes noxious fumes and <a id=\"mhy0\" title=\"ruined shoes\" href=\"http://flickr.com/photos/timmfin/2539495500/in/set-72157605354919216/\">ruined shoes</a>. You do the math. \r\n</li>\r\n<li id=\"lesson5\">I used to think hikers with those wussy poles were, well, wussy. NO. They are smart. See lesson #2 above. \r\n</li>\r\n<li id=\"lesson6\">Don't forget the rain tarp for the tent. Duct tape and a $3.99 clear tarp will make do... but boy, will <a id=\"nc55\" title=\"you look funny\" href=\"http://flickr.com/photos/timmfin/2538672977/in/set-72157605354919216/\">you look funny</a>. \r\n</li>\r\n<li id=\"lesson7\">Be careful with wet wipe dispensers. They make an excellent (and painful) Chinese finger trap. \r\n</li>\r\n<li id=\"lesson8\">And lastly and most importantly, the proposal doesn't have to be perfect. As you can see I had my fair share of blunders, but I know both Cindy and I wouldn't have wanted it any other way. We will certainly have memories of this for a long time! </li>\r\n</ol>\r\n</div>\r\n",
  "post_title": "The engagement story...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "the-engagment-story",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2008-06-16 10:32:05",
  "post_modified_gmt": "2008-06-16 15:32:05",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/2008/06/06/the-engagment-story/",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "1"
}
