{
  "ID": "179",
  "post_author": "130",
  "post_date": "2008-09-15 21:13:21",
  "post_date_gmt": "2008-09-16 02:13:21",
  "post_content": "I normally don't talk politics, but an email I just received is utterly horrible and completely unacceptable. You can find the text of that email <a href=\"http://citizenwells.wordpress.com/2008/08/28/obama-is-indonesian-obama-kenyan-obama-is-muslim-muslim-terrorists-philip-j-berg-complaint-obama-born-muslim-to-muslim-father-obama-stepfather-muslim-obama-muslim-email/\">at this blog</a>.\r\n\r\nThere have been way more than 13 tragic events in the past 50 years, and cleverly editing the list to be exclusively Islamic and male does not mean jack. \r\n\r\nYou could just as easily list 10 headlining white male serial killers from the past 50 years. Does that mean that all middle aged white men are a threat to society! Certainly not.\r\n\r\nFurthermore, remember what our country was founded upon.\r\n\r\n\r\n\r\n<blockquote>We hold these truths to be self-evident that all men are created equal; that they are endowed by their Creator with certain inalienable rights; that among these are life, liberty, and the pursuit of happiness.</blockquote>\r\n\r\n\r\n \r\nHow it is equal to point your finger across the security line in an airport and say that that man is dangerous because the way he looks? Was not America the place that accepted people across the world with open arms? Was it not the place where you could, \"Pull yourself up by your own bootstraps\"? Is it not now the place where you can establish yourself by your own hard work instead by your name, accent, or color?\r\n\r\nThis is exactly what the goal of Terrorism is. To instill fear. To terrorize. If we give in to that fear we are raising a white flag and turning our backs on our Founding Fathers.\r\n\r\nPlease live your own life. Don't let others rule it by fear.",
  "post_title": "I hate chain email, but this takes the cake",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "i-hate-chain-email-but-this-takes-the-cake",
  "to_ping": "",
  "pinged": "\nhttp://citizenwells.wordpress.com/2008/08/28/obama-is-indonesian-obama-kenyan-obama-is-muslim-muslim-terrorists-philip-j-berg-complaint-obama-born-muslim-to-muslim-father-obama-stepfather-muslim-obama-muslim-email/",
  "post_modified": "2008-09-15 21:13:21",
  "post_modified_gmt": "2008-09-16 02:13:21",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/2008/09/15/i-hate-chain-email-but-this-takes-the-cake/",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "2"
}
