{
  "ID": "162",
  "post_author": "130",
  "post_date": "2007-07-01 15:33:15",
  "post_date_gmt": "2007-07-01 20:33:15",
  "post_content": "For this round of redesign, I focused on two things.. simplicity and external content. With the last site, I had enough of all the spliced images, excessive shadows, and hacky html and CSS to pull it off. So this time I've stuck with a subtle color scheme, plenty of whitespace, and (practically) no images. I didn't only to go for the simple look, but to also make the usage of the site more simple. Those efforts include sensible minimum and maximum withs, different sidebars for the home page and individual pages, and improve readability with <a title=\"vertical rhythm\" href=\"http://24ways.org/2006/compose-to-a-vertical-rhythm\">vertical rhythm</a>. I still think that I need to make many adjustments (boy is text rhythm hard with variable sized content) but things are good enough for now.<br><br>A few times in the past I've tried different efforts to update my blog more frequently, but here I go again trying something else. Even though I have not been blogging much at all the past year(s), I still have been creating and contributing content such as my pictures on <a title=\"flickr\" href=\"http://flickr.com/photos/timmfin\">flickr</a>, bookmarks on <a title=\"del.icio.us\" href=\"http://del.icio.us/timmfin\">del.icio.us</a>, and interesting sites I've <a title=\"dugg\" href=\"http://digg.com/users/timmfin/news/dugg\">dugg</a>. When I started to get into <a title=\"twitter\" href=\"http://twitter.com/timmfin\">twitter</a>, I considered replacing my blog completely with twitter updates. That started the thought process and even though I'm not replacing the blog, I am keeping things more \"fresh\" with other content. I really like the idea that I can put things on  many different places on the web and yet still use it in one place. For those of you would really like to stalk me, you can keep tabs by looking at my <a title=\"tumblelog\" href=\"http://timmfin.tumblr.com/\">tumblelog</a> (same content, just organized into one feed of info).<br><br>I have it admit it was hard for the engineer in me to accept the fact that I'm not being very orthogonal. The \"issue\" here is that I'm putting similar content in different places. Some may say that del.icio.us, digg, and the shares from google reader all serve the same function so whats the point of using them all? The point is two fold... first in the case of del.icio.us and digg I really am using the two sites for different purposes. For me del.icio.us is my personal internet reference. Whenever I stumble upon a site that is useful (or could be useful in the future) I'll put it in del.icio.us so I can find it later (google search is good, but searching your own bookmarked references is much better). On the other hand, I'll digg sites that I find fun, interesting, or insightful. It is more of a way to share than to use.<br><br>That argument doesn't work so well for gReader shares and digg. I pretty much am using them for the same thing.  So that means I need to consolidate, right?<a href=\"#footnote-07012007-1\">ยน</a> ... No, convenience is a feature. And simply creating a share in google reader is just one keystroke/button click. Maybe someday I'll try out the greasemonkey script that will insert a digg link inside the gReader interface, but for now I'm good. Don't worry... embrace the entropy :)<br><br>So please give me some suggestions or criticisms, hopefully this will make those (few) of you that look at my site less bored :).<br><br><a name=\"footnote-07012007-1\"></a>ยน <span style=\"font-style: italic;\">For those of you confused why someone would think this way, you don't work with engineers. We always (I mean always) put way too much effort in to solving problems that really have no need to be solved. It is the case of </span>TMT<span style=\"font-style: italic;\"> (to much thinking) and even more so </span>ITIKMTIRD<span style=\"font-style: italic;\"> (I think I know more than I really do)... and yes I totally just made those acronyms up</span><br style=\"font-style: italic;\"><br style=\"font-style: italic;\"><br><br><br>",
  "post_title": "So whats new...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "162",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2007-07-01 15:39:23",
  "post_modified_gmt": "2007-07-01 20:39:23",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/2007/07/01/162/",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "4"
}
