{
  "ID": "130",
  "post_author": "130",
  "post_date": "2005-11-13 21:49:03",
  "post_date_gmt": "2005-11-14 02:49:03",
  "post_content": "<em>Inspired from <a href=\"http://www.timmfin.net/chris/?p=17\">Chris's post</a></em>\r\n\r\nImpressive. Quite eloquent yet still same old Chris underneath.\r\n\r\nI think that you are quite right that the religious \"seed\" of many comes from such spiritually inspiring situations. It is unfortunate that as our memory of the experience fades in time we tend (we as in the world) to latch on to the dogmas we've learned/been taught/guilt-ed into rather than maintaining the captivating sense of wonder we originally experienced. \r\n\r\nI believe this happens since seeking the truth is difficult, in fact I would even call it scary. When searching for truth you are teetering on a razor-thin cliff which is constantly crumbling underfoot as you ascend. At some point you realize that you have no choice but to switch to another equally precarious ledge in order to continue. The new path will become safer over time, but inevitably it will start to crumble and you will repeat the process again, and again, and ...\r\n\r\nIsn't is easier, safer, and more practical to stop and set up camp when the path broadens? Yes in fact it is. But don't you remember why you started the climb in the first place? Was it to reach safe ground? Or was it to get a better look at the stars in the sky? \r\n\r\nIts true that some of you have been carried up some distance unknowingly. Some of you have accepted this and learned to live where you were placed. Yet a few others have either stormed ahead or ran back down as fast as possible, arms failing.\r\n\r\nNo matter how you have gotten to where you are remember why you have set off on this climb. If you don't know that answer there is no shame climbing back down. As soon as you reach the bottom you will realize that there is only one way to go -- up. You may decide to climb right back up the path you went down or start up another one entirely, but at least this time you will know why.\r\n\r\nAnd equally there is no shame to continue climbing up, even without reason or assurance. You may come to place where you can no longer continue up and have to come back down. But that is not a bad thing since you have learned that the path you were on was not for you.\r\n\r\nIn fact there there is no shame however fast you are moving up or down, as long as you are moving. Sure every once and a while you may stop and take in the view, but hopefully another glance at the stars will set you in motion again.\r\n\r\n\r\nI'd have to say that I'm currently taking a slow stroll down mine. Where are you on your mountain?",
  "post_title": "Climb your own mountain...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "climb-your-own-mountain",
  "to_ping": "",
  "pinged": "\nhttp://www.timmfin.net/chris/wp-trackback.php?p=17",
  "post_modified": "2005-11-15 06:58:22",
  "post_modified_gmt": "2005-11-15 11:58:22",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=130",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "4"
}
