{
  "ID": "94",
  "post_author": "130",
  "post_date": "2005-04-26 17:52:43",
  "post_date_gmt": "2005-04-26 22:52:43",
  "post_content": "I found this today, and I had not blogged in a while (I should talk about my boston trip I had last weekend and all the stuff thats going on.. but I guess I'm a bit busy and lazy for that, Whoops! Maybe sometime next week after I finish my CS project, my 2 review papers, my science fiction story, my photography paper, my OS exam, etc). Anyways, I wish I had done this before, Genius!\r\n\r\n<blockquote>Hal 2000\r\n\r\nFor a computer programming class, I sat directly across from someone and our computers were facing away from each other. A few minutes into the class, she got up to leave the room. I reached between our computers and switched the inputs for the keyboards. She came back and started typing and immediately got a distressed look on her face. She called the teacher over and explained that no matter what she typed, nothing would happen. The teacher tried everything. By this time I was hiding behind my monitor and quaking red-faced.\r\n\r\nI started to type, \"Leave me alone!\"\r\n\r\nThey both jumped back, silenced. \"What the... \" the teacher said.\r\n\r\nI typed, \"I said leave me alone!\"\r\n\r\nThe kid got real upset. \"I didn't do anything to it, I swear!\"\r\n\r\nIt was all I could do to keep from laughing out loud. The conversation between them and HAL 2000 went on for an amazing five minutes.\r\n\r\nMe: \"Don't touch me!\"\r\n\r\nHer: \"I'm sorry, I didn't mean to hit your keys that hard.\"\r\n\r\nMe: \"Who do you think you are anyway?!\" Etc.\r\n\r\nFinally, I couldn't contain myself any longer and fell out of my chair laughing. After they had realised what I had done, they both turned beet red. Funny, I never got more than a C- in that class.\r\n\r\n------\r\n\r\nfound in: alt.humor\r\nposted by: Mr F-B-I <mr -fbi@mystacy.com>\r\n</mr></blockquote>\r\n\r\n<a href=\"http://web.ukonline.co.uk/eric.price/humour2/0452.htm\">http://web.ukonline.co.uk/eric.price/humour2/0452.htm</a>",
  "post_title": "Hal 2000",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "hal-2000",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-04-26 18:07:53",
  "post_modified_gmt": "2005-04-26 23:07:53",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=94",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "2"
}
