{
  "ID": "143",
  "post_author": "130",
  "post_date": "2006-01-07 23:44:24",
  "post_date_gmt": "2006-01-08 04:44:24",
  "post_content": "I've come to realize that in user interfaces (whether digital or physical) its often the subtleties that make most of the difference. The best of these are details which you use without realizing or without prior knowledge. Simple examples are right clicking on an object  to see what you can \"do\" with it or using page up/down in some application (like a photo app) without taking the time to think \"I wonder if page up will move to the previous picture\" -- it's when you try something and then realize (afterward) that you did it by native reflex, without thought at all.\r\n\r\nUnfortunately, there is a problem with getting excited about stumbling on seamlessly intuitive UI features. You are prone to get frustrated when those things \"that should just work\" don't work. :)\r\n\r\nToday's example of that is clicking a link while visiting a web page. Its not every time you click a link, but those times when you realize \"oh crap, I didn't want to click on that... now I have to rush really quickly to try and hit the stop button before the next page loads (and man is that stop button small)\". What I tried today is clicking on the link again after realizing I didn't want to go to that page. I think my mind tried this since there are many hide/open ui patterns in many of the new AJAX websites. My mind must have jumped and tried out that same pattern in this (different) situation, but alas -- it doesn't work.\r\n\r\nSo this is where I say \"Why not?\"\r\n\r\nAnd now this is the point where I realize my intention of just mentioning a tiny ui feature is blown out of proportion by me doing all of this extraneous explanation.\r\n\r\nSo yea, its a small thing but at least I think it would be useful.\r\n\r\nSo while I'm on this topic another small ui gesture I'd love to have is feed readers (news aggregators/whatever name is in vogue now) that display the length of a post alongside the title. Maybe it's a number of paragraphs, maybe it's a small icon to represent the long posts, maybe it's some representative color gradient. All it has to do is give me some blurry impression whether the post is \"more longish\" or \"more shortish\". That could makes broswing/flipping though feeds much, much easier. If its a feed that I'm only semi interested in then I can just skip over the long ones. (I guess I'm the kind of person that feels guilty stopping reading something halfway through). Ever since my feed reader has gone out of control (I spent much of today trying to work on this) I've had to start breezing though all the \"possibly less interesting\" entries instead of reading everything (in addition to dropping the blogs I just never got around to).\r\n\r\nThe reason I'm making such a deal about these simple touches is that I really do think they make quite a large difference when amortized over the long term. (oh yea, and also if enough people hear about it and become interested they might get the motivation to write feature requests for me) :)\r\n\r\nOh.. just one more thing. Will <a title=\"rememberthemilk\" href=\"http://www.rememberthemilk.com/home/timmfin/\">rememberthemilk</a> please show the number of tasks along/inside each tab? Pretty please?",
  "post_title": "The little things...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "143",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2006-01-09 22:17:10",
  "post_modified_gmt": "2006-01-10 03:17:10",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/2006/01/07/143/",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
