{
  "ID": "33",
  "post_author": "130",
  "post_date": "2004-08-28 03:41:06",
  "post_date_gmt": "2004-08-28 07:41:06",
  "post_content": "It has been great to watch the Olympics the past few weeks, particularly since I've been relaxing and had the time to watch quite a bit. Unfortunately, it has also made me think about some of the darker sides of human nature.\r\n\r\nWhy are humans so greedy? Moreover, why are Americans especially greedy?\r\n\r\nMy case, the USA basketball team (just one of many possible examples). They have quite a reputation to live up to. I'm not going to look up statistics, but previous \"Dream Teams\" have continuously won gold medals and almost literally obliterated opposing international teams. So, it is fairly obvious to make them a favorite, the <em>favored</em> team to win the gold.\r\n\r\nAnd now, after losing the semifinal match and losing a chance for the gold and silver expectations were far from being met. So, of course what is the natural reaction of the media (and a large majority of Americans I'm assuming)? Disappointment, and in some cases I may even expect anger. People are reacting unfavorably to our own countrymen. I'm sure they will get this Olympic memory rubbed in their faces and eventually get the underlying message that the are unworthy, no good, .....\r\n\r\nI personally think that this is ridiculous. Holding any animosity toward those players is just absurd? Do you think they wanted to lose? It thought it was quite interesting when when one of the players said in an interview that they [Dream Team] just wanted to get in and get out of Athens so they wouldn't have to deal with a big story. That story is the story which is happening, the story of not living up to expectations, the story of not getting the gold medal. <em>(see note about the basketball team at end of story)</em>\r\n\r\nHeaping all this guilt upon our athletes even before they perform? That is just wrong. Yes, it is ok to consider someone a favorite, but it is our responsibility to be supporters, always hope that they do their best, to be respectful no matter how well they do, and to be proud of them. Some of us have been so spoiled that we can only be proud of those who wear gold medals around their neck, and even worse is that when they already have gotten the gold the only acceptable outcome is a repeat.\r\n\r\nThis makes me think of a parent of a small kid at a county soccer game. When the team loses does the parent berate the child for not doing well enough? No they should be happy and proud for whatever they could do. Unfortunately, there are still many parents who can't do this. I don't even know what to say about this, when competition comes before the love of a child.\r\n\r\nI wish I knew what the root of this behavior was. There are all kinds of obvious relations to our materialistic society, spoiled children, etc. Maybe we just have a misconstrued understanding of competition. Now don't get me wrong, I'm a very competitive person (and very much enjoy winning), but competition is <em><strong>not</strong></em> about winning! It is about trying your best, giving your all, training, sacrificing, and eventually having fun or getting enjoyment.\r\n\r\nThe Olympics should not be about having the most gold medals, being the best athlete, or getting the most media attention. It is all about competition, not how our society views it, but in the manner which I (attempted) to describe earlier. I think that the friendly yet still aggressive competition the Olympics brings is helpful to each nation and helpful to our world as a whole. Is it possible for us to leave behind our selfish and greedy natures? I don't know, but I wish it were.\r\n\r\n<em>Note about USA basketball team:</em> This example may be a bad choice since there are many other issues involved with the USA basketball team, such as the players who turned down the offer to play for the dream team and the bad choices of the selection committee. It could very well be the case that some are mostly angry at these other issues, and not as much what I was saying. But, my point is not about USA basketball though it seemed the best example to use (since I knew I was likely quite widespread).",
  "post_title": "Why are we so greedy?",
  "post_category": "0",
  "post_excerpt": "It has been great to watch the Olympics the past few weeks, particularly since I've been relaxing and had the time to watch quite a bit. Unfortunately, it has also made me think about some of the darker sides of human nature.\r\n\r\nWhy are humans so greedy? Moreover, why are Americans especially greedy?\r\n\r\nMy case, the USA basketball team (just one of many possible examples). They have quite a reputation to live up to. I'm not going to look up statistics, but previous \"Dream Teams\" have continuously won gold medals and almost literally obliterated opposing international teams. So, it is fairly obvious to make them a favorite, the favored team to win the gold.\r\n\r\nAnd now, after losing the semifinal match and losing a chance for the gold and silver expectations were far from being met. So, of course what is the natural reaction of the media (and a large majority of Americans I'm assuming)? Disappointment, and in some cases I may even expect anger. People are reacting unfavorably to our own countrymen. I'm sure they will get this Olympic memory rubbed in their faces and eventually get the underlying message that the are unworthy, no good, .....\r\n\r\nI personally think that this is ridiculous...",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "why-are-we-so-greedy",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-08-28 11:07:42",
  "post_modified_gmt": "2004-08-28 15:07:42",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=33",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "3"
}
