{
  "ID": "111",
  "post_author": "130",
  "post_date": "2005-06-17 09:48:01",
  "post_date_gmt": "2005-06-17 14:48:01",
  "post_content": "Whew I'm sore and tired. We spent yesterday in the Grand Canyon and.. oh wait, let me talk about the day before that first.\r\n\r\nOn Wednesday we were in Zion National Park. It was pretty interesting, but its very hard for me to say anything too great about it since it was totally blown out of the water after seeing the Grand Canyon. We explored Zion's canyon by taking the tour bus and hiking around a bit. I was looking forward to doing some hiking on this trip, ya know wanting something strenuous and walking along cliffs etc. Unfortunately the hikes we went on in Zion were more like paved mountain walks than \"hiking\", but the hike in the Grand Canyon was a different story.\r\n\r\nSo yesterday we went on the North Kaibab trail on the North Rim of the Grand Canyon. Now that was a hike. We started the trail at 10:50am and after traveling 10 miles round trip, going down and then back up 3500ft of elevation, drinking 4 liters of liquid, eating two sandwiches, chips, peanuts, and powerbars, 200 some pictures, and 5 hours and 10 minutes later we reached where we started (well Pete got back a bit later since I pushed ahead and ditched him on the way back, sorry Pete). Whew, that was a challenge and more than satisfied my hiking desire, and I absolutely loved it. By the top I got back to the top I was dead tired. That's what I get for trying to push myself as fast as I could go up steep inclines for over two hours. That may have been some of the best exercise I've had in quite a long time.\r\n\r\nAnyways the Grand Canyon is simple amazing. It is certainly called \"Grand\" for a reason. The views from the hike were amazing and provide and inside, close-up perspective of the canyon, but the observation points at the rim were simple stunning. Its just so, large, natural, and beautiful. I definitely recommend seeing it sometime :).\r\n\r\nToday is a driving day. The goal is to get to the Grand Teton mountain by nightfall. On the road again… I just can't wait to….\r\n",
  "post_title": "Ahhh, pretty rocks… ",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "ahhh-pretty-rocks%e2%80%a6",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-06-18 01:27:20",
  "post_modified_gmt": "2005-06-18 06:27:20",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=111",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "1"
}
