{
  "ID": "58",
  "post_author": "130",
  "post_date": "2004-12-31 13:30:16",
  "post_date_gmt": "2004-12-31 17:30:16",
  "post_content": "The day after Christmas we drove back Virginia from New York to go on the annual ski trip with my mom's extended family to Massanutten. This year I decided to give snowboarding a try since my snowboarding friends have always given me a bad time, and a few others were going to try and learn as well.\r\n\r\nI started off pretty well the first few hours but as soon as I got a bit of confidence and tried to go a bit faster the situation changed pretty quickly. I thought that I'd be able to miss all the problems everyone talks about when learning to snowboard, but boy was I wrong. The second day (I was on the mountain 4-5 hours the previous night), I woke up sore and frustrated but I couldn't give it up yet (I was really thinking about it though). Thankfully my balance finally started to click on the second day. I didn't look very good coming down the mountain, but I could make it down an easy blue slope with a few falls. So the next day, being a bit confident and reckless I pushed myself more. How about the hard blues and a black diamond? They turned out to be not much of a problem. Don't get me wrong I still was falling every once and a while (once pretty hard on a black) but by then I think I was starting to look like someone who actually knew what they were doing.\r\n\r\nSo, my suggestion to anyone learning to snowboard is to fight through the pain on the first day or so and then keep trying harder slopes than you think you can do. There are two things that could happen, one you learn much more quickly or two you could hurt yourself very badly... Hmm, maybe that isn't such a good suggestion :).\r\n\r\n Its good that being reckless with your physical self-being comes in handy every once and a while.",
  "post_title": "Holiday update 2",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "holiday-update-2",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-12-31 13:30:38",
  "post_modified_gmt": "2004-12-31 17:30:38",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=58",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
