{
  "ID": "52",
  "post_author": "130",
  "post_date": "2004-12-06 13:36:49",
  "post_date_gmt": "2004-12-06 17:36:49",
  "post_content": "Skipping all the stuff that gone on in my life the past few weeks. I guess there was something about Thanksgiving, I'll post those pictures sometime eventually (sure...).\r\n\r\nAnyways, I've finished another project in my digital art class. This time I went a bit beyond the requirements and put a lot of effort toward making something unique and interesting. I know that I put the effort in (20+ hrs for an art project.. I'm supposed to put that much work to my CS classes right?), but you can be the judge whether it is interesting or not.\r\n\r\nHere is a link to it: <a href=\"http://www.timmfin.net/flashGallery/\">The Online Gallery</a>. Below is a quick explanation and some directions.\r\n\r\nThis piece is my first experiment with an online, shared, gallery and or workspace. In this virtual gallery anyone with a web broswer can \"hang\" artwork to create his or her own exhibition for display, or edit the existing exhibition as he or she sees fit. The core idea of this gallery is that all changes you make are saved for others to see, in essence making this a ever-changing collaborative gallery.\r\n\r\n<h4>How to use the gallery</h4>\r\n\r\nThe interface for this piece is fairly simple. Any image can be moved by dragging it to a new position. To scale the image to a larger or smaller size simply hold the up arrow (increase size) or the down arrow (decrease size) and click and hold.\r\n\r\nTo place a new image, you must first upload the image to the server. The server will accept any jpeg image that is non-progressive (not interlaced) and is smaller than two megabytes in size. To upload an image, click on the upload button. In the new window that appears click browse to select the image from your computer. After you have selected the image click submit. Note this could take some time, depending on your connection speed\r\n\r\nAfter the image is uploaded you must refresh the flash window by pressing your browser refresh button or clicking the refresh button in the movie. The newly uploading image will now appear in the list of available images (only if the upload has successfully completed). To \"place\" the image on the wall, select it in the list and press the import button. After a few seconds the image should appear attached to the mouse, simply click the location you wish to place the image.\r\n\r\nTo delete an image just drag it to the very top or bottom of the flash window (the top or bottom of the background picture).\r\n\r\nThe buttons and list can be hidden from the screen by pressing the \"h\" key on the keyboard.\r\nAbout the work\r\n\r\nCurrently, this piece is my initial experiment and is still far from finished. I plan on working more with this in the future. If you have any comments or questions feel free to <a href='mailto:timmfin@timmfin.net'>email me</a>.",
  "post_title": "My own virtual gallery",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "my-own-virtual-gallery",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-12-06 13:39:22",
  "post_modified_gmt": "2004-12-06 17:39:22",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=52",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "1"
}
