{
  "ID": "125",
  "post_author": "130",
  "post_date": "2005-10-11 20:54:07",
  "post_date_gmt": "2005-10-12 01:54:07",
  "post_content": "![51708085][small][]\r\nI've had a cell plan with Verizon for about 5 years now and for the most part I cannot complain. The phones have been decent and the reception has been above average. Heck, sometimes I got one bar of service at my good ol' home in the \"ruralburbs\" of Southern Maryland (that's rural for y'all urbanites and a suburb for those whom have a more country descent).\r\n\r\nSo why start complaining now? Well its because I'm finally joining the rest of the world that wants to do more with a cell phone than just talk. The first thing that comes to mind is txt messaging. I never bought into the txt hype for the past few years since it never seemed very useful. Sure I could do in situations when I couldn't talk... but in how many of those situations is it convenient to mangle my thumbs for 5 minutes writing a few sentence message?\r\n\r\nSo why now? I'm trying to fix my forgetfulness. In the past I've tried to use pdas but unfortately those always ended up lost, broken, or stuck in a black hole in my backpack from which there was no return (aka, I never remembered to use it). Recently, I've been hyped by the <a href=\"http://www.amazon.com/exec/obidos/tg/detail/-/0142000280/104-3367414-0941565?v=glance\">GTD</a>  <a href=\"http://merlin.blogs.com/\">phenomena</a> and have started using a <a href=\"http://merlin.blogs.com/43folders/2004/09/introducing_the.html\">hipster pda</a>. So far that actually has not been working too badly and I've found it very useful for keeping track of tasks at work. (Plus it has the benefit of being a pda that won't break and costs a few bucks). The problem is that I forget to carry it around with me. And when I actually do carry it I don't ever take it out... the same problems with the fancy electronic pdas. So I'm still seeking help for remembering to calling that person back, picking up milk at the grocery store, or finally getting around to get someone to fix that window I broke in my apartment (whoops).\r\n\r\nSo what is something I do always carry around with me? My phone (even more so when I don't have a land line.. well that's a lie, I do have a land line since its free with our current telcom setup, but I don't even know what the number is). And now, since all the new fangled Web 2.0 apps can send txt msgs (namely <a href=\"http://www.backpackit.com\">backpackit</a>) I can alert myself via my cellphone. Just set a reminder and later (when I'm sure I've totally forgotten about the reminder I've set) I'll get a nice vibration in my pocket and just the kind of kick in the but I need to actually remind myself to do something. And even better, I can txt from my phone to backpackit to remotely jot down something on the web. Next throw in a cell phone with a basic web browser and I'm in cell phone notes/reminder heaven.\r\n\r\nSo how does this all come back to Verizon? The cost of txt msgs. I know that txt messenging is all the rave in the rest of the world, but things have been somewhat slow in the US. Right now, without getting a plan change I'm charged 10 cents for every txt msg sent or received. You are kidding me right? Ok, lets do some math. I pay $40 for 450 minutes so that is around 9 cents a minute. So one text message costs more than a minute of air time? Lets assume that my cell phone can transfer data at around 50Kbps (and it probably can transfer <a href=\"http://electronics.howstuffworks.com/cell-phone11.htm\">much faster</a>). That events out to be 6250 bytes per second. So a txt message has a max size of 160 characters and I'll be nice and assume they are using a double-byte chatacter set. That's 320 bytes. Sure the data has to be packaged up somehow, but there is no way that packet it even going to approach 5000 bytes. By my (wonderfully assuming) calculations a txt message uses up a fraction of a second of air time. Sure I left out the whole part about having to check and negotiate for a connection, but come on that can't be the sole cost of the message, can it?\r\n\r\nArg... sure I can get around this by paying $5 a month for a whole whopping 50 messages.. ahem. Thats. Still. The. Same. Price. Even better the I can get the \"Great Deal\" of 250 messages for $10! The sad thing is that despite this rant, I'll be signing up for that Great Deal next month. Sigh.\r\n\r\nI guess supply and demand is only a benefit if people actually pay attention to how much something costs. So America please start txting like the rest of the world.\r\n\r\n\r\nps: I did a bit of looking around and it seems like the other companies are about the same, though some do offer decently priced additional txt plans. Fortunately/unfortunately nearly all of my family (and a few friends) have Verizon, so free in calling prevents me from switching carriers.",
  "post_title": "Can you hear me now?",
  "post_category": "5",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "can-you-hear-me-now",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-10-11 20:57:51",
  "post_modified_gmt": "2005-10-12 01:57:51",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=125",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "4"
}
