{
  "ID": "113",
  "post_author": "130",
  "post_date": "2005-06-21 09:43:16",
  "post_date_gmt": "2005-06-21 14:43:16",
  "post_content": "Since last time Pete and I have finished off our itinerary. Both Grand Teton Ntl. Park and Yellowstone Ntl. Park have rounded off the trip with spectacular views and sights yet again completely different than the rest of the trip.\r\n\r\nAfter driving past Salt Lake City (and unfortunately you couldn't really see the lake from the road, maybe we should have stopped), we stayed the night in yet another KOA campground (did I say yet how cool those places are?) near to the Grand Teton entrance. If the defining feature of the Grand Canyon was enormous rock formations, staggering cliffs, and unreal natural formations, then the defining features of the Grand Tetons were sharp and princely snow-covered mountains and graceful lakes and rivers filled with a wonderful clear/light turquoise water. Unlike the Grand Canyon, the Tetons didn't feel unreal. It felt amazingly real. By that I mean that the views you see there are the kind that nature is supposed to look like. I sat and admired the scenery feeling that this is what the world is supposed to look like (well not everything exactly looking the same, but you know what I mean). And it wasn't just the vista-esque views that were this way, but practically the entire park. The hike we went on took us around a lake, up a bit of the mountain, and then back down to a secluded waterfall. The sights from the trail were equally as beautiful, but unfortunately they were also had throngs of tourists snapping pictures (I can't blame them though). I still can't believe how clear, clean and refreshing the water looked. It almost beckoned me to take a sip (though I knew that was probably a bad idea). I'm probably carrying on a bit too much, but I highly enjoyed the Tetons. It certainly won't appeal to everyone the same way it has to me, but if you elegance and cleanliness of nature, that's the place to go.\r\n\r\nOur final stop was Yellowstone, and even with two days of touring we still didn't get to see the entire park. I'll get out my two frustrations first so I'm not thinking about them while I'm talking about the good stuff. First of all, the camping/lodging reservation/infrastructure systems stunk. Antiquated garbage. We originally signed up for two nights at Canyon village campground and came the morning of the second day to reserve a third. First we were given the reservation and then we noticed that it wasn't for the next day but rather the current day. That wasn't right so we went back. We then were told that the system could not reserve anything until we checked out after 10:00. So we wasted a bit of time and came back. I think that the campgrounds was full (maybe I'm exaggerating since I don't remember exactly) but by then I felt that we could see almost everything else in the park that day so we could grab a campground outside (ie in Cody, WY where we are right now).\r\n\r\nThe second annoyance was road closures. The Yellowstone staff made it obvious that one of the main roads inside the park was closed. That closure wasn't a big deal at all, just a minor annoyance that caused us to drive a bit more than if it had been open. The real annoyance was that the road to the east entrance of the park closed from 8:00pm to 8:00am. We didn't know this at all and noticed the closure sign around 7:50pm when we were more than 15 miles away from this to-be-closed road. We pulled around and asked a ranger to be sure, and then frustrated we turned around to redrive the last two hours we drove to get to the East exit (the next best exit was back where we came from just before, and by next best exit I mean adding an additional 3-4 hours to our trip out). Ergg… That certainly was annoying, but really we had time so I shouldn't get too pressed about it. We later discovered that the East exit road closure was listed in small print of the back of the newspaper we were handed, but it would have been nice if they had made it more obvious.\r\n\r\nAnyways, Yellowstone certainly had the most interesting individual sights to see (and the most different). Yellowstone had several of the same kinds of features some of the other parks had. It had forests, large lakes, and views of mountain scenery. It even had its own canyon with associated river and falls (it was called the Grand Canyon of Yellowstone). But none of these were the defining features of Yellowstone. The real features were the abundant wildlife and equally abundant hot springs and geysers.\r\n\r\nThe roads in Yellowstone are kind-of slow to start with, but they become much slower when you have people stopping every few miles to look and take pictures of bison, mule deer, and bears (those are the ones we saw, we didn't see any elk or moose). I'm not a huge wildlife fan but seeing just how large these animals are and seeing them in their natural habitat was very cool. (And yes I got to shot pictures of a bear from only 30 yards away or so, but it was only a cub so it was not quite as thrilling).\r\n\r\nNow the thermal features of Yellowstone are something else. The colors of the hotsprings are totally different than anything I've ever seen in nature before. The are hard to describe, so my pictures will have to do them justice later on. The geysers are of course amazing (though only really so when they are going off, other than that they are kinda boring rock steam spouts). We sat and waited for Old Faithful and he wasn't quite as prompt as promised (the rangers gave a plus or minus 10 minute time frame, but it went off more around 20 mins late). As Old Faithful was going off, I was taking so many pictures that I almost forgot to look. It is unfortunate that the geyser spout didn't quite live up to all the hype surrounding it, but it still was cool nonetheless. I'm quite amazed that such a natural phenomenon is predictable less than the magnitude of hours (though the other geysers has much larger prediction ranges. Some were +- hours, and others years).\r\n\r\nI'm cutting Yellowstone short (especially since we were there two days) but I should get going. Time to pack up camp and get on back to the east coast. We'll probably be back sometime Thursday (depends on how much we stop to see on the way back).\r\n",
  "post_title": "Ahh nearing an end...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "ahh-nearing-an-end",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-06-21 12:31:44",
  "post_modified_gmt": "2005-06-21 17:31:44",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=113",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "5"
}
