{
  "ID": "56",
  "post_author": "130",
  "post_date": "2004-12-24 01:00:56",
  "post_date_gmt": "2004-12-24 05:00:56",
  "post_content": "Ah, the holidays. I'm hanging around in Victor, NY (10 miles from Rochester) in my <em>new</em> home. But, the funny thing is that my whole family is here and it just doesn't feel like home. I never have really missed our old house in Calvert County too much (though I have missed that environment), but now I do. All the old furniture and pictures look so awkward since they are familiar, but placed in a totally differnt location/context/etc...\r\n\r\nDon't get me wrong, the house is very nice. In fact I like it quite a bit, but it just doesn't have that home feel at all. Thats not a bad thing I guess, I am kinda about to move and go live on my own soon anyways. Pictures will come (do I ever live up to those promises?).\r\n\r\nI haven't been doing much here at all other than a bit of xmas shopping, putting up pictures on the walls, and lots of reading. So far I've read two books (~400 pages) in 3-4 days. These were <em>Ender's Shadow</em> and <em>Shadow of the Hegemon</em>, following after the events in <em>Ender's Game</em>. Well, actually not after since <em>Ender's Shadow</em> was not a sequal, but rather a parallel story.  I think that the author pulled this off very well too, since the parallel perspective was just as interesting as the orginal story, and reading the second has only made the first more intruiging since there was so much more to the story that never came to the surface. I'm very glad to hear that the are still many books left to read in the Ender series, I get seem to get enough of that story.\r\n\r\nThe more and more I read, the more I wonder how many good books are out there? It has been quite a while since I've read something that I didn't like so I'm getting worried. Worried that I'm rationalizing to myself that the books were a good read... But I don't think that is the case. Anybody have a suggestion for something bad to read?  :)  Just kidding.\r\n\r\nGood news that my grandparents (my Dad's dad and Mom's mom both were in the hospital recently) are doing better. I hope that everyone is doing well, having fun, and <strong>not</strong> getting too caught up in this over materialistic holiday hype. Celebrating the messiah's birth by spoiling children? Don't get me wrong, I love Christmas, I love carols, and trees, bows, and the gift of giving, but come on, to  most poeple Christmas is about recieving, and I'm scared for all the kids that are being brought up that way. I know that there are still many out there who love to give and realize that is the important thing, and I salute you for that but ...\r\n\r\nOh, I don't feel like getting into this, just all you parents out there please don't spoil the future of America more than it already is. Our country is not exactly getting any less greedy ya know.",
  "post_title": "Holidays...",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "holidays",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-12-24 01:03:54",
  "post_modified_gmt": "2004-12-24 05:03:54",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=56",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
