{
  "ID": "30",
  "post_author": "130",
  "post_date": "2004-08-21 22:22:48",
  "post_date_gmt": "2004-08-22 02:22:48",
  "post_content": "Here a bit of a change from the semi-regular updates I've been posting. I figured that I could give a small review on a couple of books I've read recently. These books fill an interesting niche; one that suites myself well, but possibly not many others.\r\n\r\nThe author of these books is Donald E. Knuth. For those who are not too familiar with Computer Science history (well recent history, Knuth is still very much alive), Knuth is called by some \"the Father of Computer Science\". He is widely known for writing three volumes of The Art of Computer Programming, which Amazon.com calls the \"definitive description of classical computer science.\"\r\n\r\nThe two books I've just finished reading, Things a Computer Scientist Rarely Talks  About and 3:16 Bible Texts Illuminated, are different from Knuth's technical literature because the focus is not about computers, but about spirituality. These books are intertwined since Knuth uses his experiences writing 3:16 as material for Things a Computer Scientist Rarely Talks About. But in both, he combines his experiences as a  prominent computer science academic and his experiences as a life-long Christian.\r\n\r\nI found both of these books very stimulating and I'd highly suggest for you to look into them if you are a geeky Christian like me. For others who are interested in the crossovers of religion, spirituality, and computer science, Things a Computer Scientist Rarely Talks About may be for you. For those who would like to read about a scientist's approach to bible interpretation and translation check out 3:16 Bible Texts Illuminated.\r\n\r\nFor those are not interested in any of these topics, no big deal. Hopefully I read something more in your interests soon.\r\n",
  "post_title": "Little book review",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "little-book-review",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-08-22 11:19:59",
  "post_modified_gmt": "2004-08-22 15:19:59",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=30",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
