{
  "ID": "83",
  "post_author": "130",
  "post_date": "2005-03-09 00:03:19",
  "post_date_gmt": "2005-03-09 05:03:19",
  "post_content": "<p>Today, Harvard Business School canceled the acceptance of 119 students they had written acceptance letters for but not yet delivered. The root of all this was a discovery by one applicant that you could easily access your own acceptance (or rejection letter) online through ApplyYourself's horribly insecure online application system. Harvard's stand is that these so called \"hacking\" actions were totally unethical and \"a serious breach of trust\".</p>\r\n\r\n<p>Come on. First of all, the procedure to do this was not a \"hack\" at all but a simple cut and paste into the address bar. If this is hacking then I'm a genuine hacking genius since I use the same sort of tactic to navigate broken websites all the time :). I hope the HBS dean realizes that he cannot use this as an ethical metric, rather I'd think that 75% or more of the people that saw this hack went ahead and tried it. They were only seeing something that was theirs (they couldn't access other students accounts) which they would see soon anyway. I would agree that using the \"hack\" is a little bit in the grey area, but more so a pale creamy grey then black. If this hack has lasted longer than 9 hours would they have rejected 3000 students?.. Geeze</p>\r\n\r\n<p>Read about it on <a href=\"http://slashdot.org/articles/05/03/08/2341213.shtml?tid=172&tid=146\">Slashdot</a></p>",
  "post_title": "You're not welcome here anymore..",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "youre-not-welcome-here-anymore",
  "to_ping": "",
  "pinged": "\nArray\n\n",
  "post_modified": "2005-03-09 16:20:29",
  "post_modified_gmt": "2005-03-09 21:20:29",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=83",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
