{
  "ID": "17",
  "post_author": "130",
  "post_date": "2004-07-11 15:26:39",
  "post_date_gmt": "2004-07-11 19:26:39",
  "post_content": "Already? Summer is moving along, which is both good and bad. Bad thing is that the big, end of summer work Expo is less than a month away (ie time to get butt in gear and really work hard). Good thing is that I'll have some free time in the middle of August to hang around before school starts.\r\n\r\nI'm having a hard time making a career decision and I don't have that much longer to think about it. As most have told me, its probably a very bad thing to wait till the last minute to make this decision. Although the choice may not change what I end up doing in 10-15 years, it will certainly have a significant impact on the comming future.\r\n\r\nMy project at work is going alright. I wish that we were futher along and accomplishing more, but maybe I orginally set my aim too high, or maybe I've not put enough effort forth... Fortunately, my team is starting to pull together and push forward, so I'm hopeful that productivity will continue to increase.  This next week will  be rather busy with presentations, talks, and meetings (known among the interns as the IBM tax) but I do see how these seemingly wasteful activities are very important, not only for the success of the project, but also for career skills improvement and networking with various IBM employees and executives.",
  "post_title": "Summer going quickly",
  "post_category": "0",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "summer-going-quickly",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2004-07-11 15:26:51",
  "post_modified_gmt": "2004-07-11 19:26:51",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=17",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "0"
}
