{
  "ID": "117",
  "post_author": "130",
  "post_date": "2005-07-30 23:45:28",
  "post_date_gmt": "2005-07-31 04:45:28",
  "post_content": "So whats new, or at least whats kinda maybe new... \r\n\r\nSo last weekend I was back in Maryland picking up my car from the shop. The drive down was quite horrendous, but was totally my fault. I'll remember to drive around New York next time since going through it (on 95) during rush hour is a very bad idea (bad enough to delay your trip 2-3 hours). Other than that small itch, the trip seemed to go by rather quickly (the podcasts that I brought along were quite a help).\r\n\r\nSaturday was quite busy. We got up early to head over to my friend Ellis's place that's near the bay south of Baltimore. <a href=\"http://spi.panaverse.com/journal/\">Steve</a> and I got our first doses of watersking which was quite fun. After a few hours of that, we headed back to 's<a href=\"http://www.semantichive.com/\">Pete's</a> place to go off in different directions. Steve was heading to hang out with a friend that was at UMD for the summer, and I drove down to good ol' Calvert County to hang out with the high school buds at <a href=\"http://www.timmfin.net/chris\">Chris's</a> graduation party. We (as in Chris, Ter, Laura, Cor(ine)y, and me) just talked and caught up on whats going on (and ate good party food too). Its a bummer that I couldn't stay longer there, but there was yet more people to see and things to do! \r\n\r\nNext I caught up with my good friend Karen and head over to a party in Arlington (and yes I live in Arlington Ma, but this is Arlington Va). The party was held by a bunch of recently graduated UVAers, one of which was the boyfriend of Karen's future roommate. We didn't spend too long there, but I did mange to convince Karen to play a game of foosball (she did pretty well for the first time). Afterwards we head back to her place and watched the second Harry Potter movie (she had just read the 6th book and I was just about to read it). I forgot how long the movie was and unfortunately ended up not heading back to Pete's until 2:00am.\r\n\r\nNothing exciting happened on Sunday. In the morning I washed the Saturn and Steve and I helped me drop off the cars at my aunt's place in Leesburg. Shortly after we were back on the road to Mass. and thankfully the trip was quite a bit shorter than the way down (we avoided New York  this time). Oh and for this drive I was driving my car again... finally.  I really have been spoiled by my car, driving it feels like a dream as compared to the Saturn I had been using (no offense to the previous users).\r\n\r\nI wish I had more time down there, but I'm very glad to see all the people I did. I'm sorry for those I missed (<a href=\"http://www.livejournal.com/users/always_a_terp/\">Bill</a>, Joo, Tom, <a href=\"http://benzene.diaryland.com/\">Irene</a>, and the other UMDers). I didn't try to get a hold of you since I didn't have any time available :(.\r\n\r\nAnd for the rest of the week in a much shorter version: work, frisbee, work, work, hanging out with new IBMers and seeing <em>The Island</em> work, work, frisbee, out at the Redline (bar) with Dan and friends from out of town, and then today playing RISK on the commons with the same guys (<a href=\"http://spilog.org/archives/2005/07/30/let-the-war-begin/\">some pictures of the game</a> at Steve's blog).",
  "post_title": "Chuggin along...",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "chuggin-along",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-07-31 10:17:41",
  "post_modified_gmt": "2005-07-31 15:17:41",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=117",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "1"
}
