{
  "ID": "119",
  "post_author": "130",
  "post_date": "2005-08-25 23:05:09",
  "post_date_gmt": "2005-08-26 04:05:09",
  "post_content": "Hey, long time no blog, but I guess that's the regular for me now.\r\n\r\nSo work, life, and everything else have been sailing along. I finally feel like I'm actually working now and not just a new hire floundering about. But whats going on other than work?  I've been hit by a stretch of visitors recently, my parents the past weekend and my Aunt Liza and cousin DJ the weekend before that.\r\n\r\nMy Aunt was on her way back from Maine and stopped in at Arlington for an afternoon. It was awfully hot and humid that day so we decided to stay in and around Arlington - just to hang out, grab some food, and get time to play video games with my younger cousin :). I got a chance to break out my  <a href=\"http://en.wikipedia.org/wiki/Dance_Dance_Revolution\">DDR</a> pads again (it's been quite some time) to show DJ how funny a white boy dancing to psychedelic Japanese techno-music can look.\r\n\r\nThe past weekend my parents were in town doing the official \"checking-on-your-newly-working-child-and-making-sure-they-are-surviving\" trip. <em>Yes Mom, thats a joke :).</em> They arrived Friday afternoon and that night we walked around town and decided on going to a Asian restaurant just a minutes walk from my apartment (ya know, I didn't notice how many Asian and Indian restaurants Arlington hade before).I chose to go with my standard Koren choice, Dol Sot Bi Bim Bop, since I couldn't gather the courage to go for the sushi (one of these days...). Despite the somewhat lackluster service and appearance, the food was quite good.\r\n\r\nOn Saturday we headed down into the city to tour around. We (and everone else and their mother as well it seemed) took advantage of the nice weather to walk the <a href=\"http://www.thefreedomtrail.org/\">Freedom Trail</a> and catch a ride on the one and only <a href=\"http://www.bostonducktours.com/\">Duck Tour</a> :). I highly recommend both to whomever has not visited in recent history (really... you skeptics may think the Duck Tour looks corny, but its rather enjoyable so don't miss it). For the rest of the time we made sure to have a few drinks and cups of clam chowder and eventually finished up with a wonderful dinner at Legal Seafood. Good times, I was glad to see the folks and happy to know that my mom shouldn't be worried sick anymore :).\r\n\r\nAnd there is still more to come! Karen will be up next weekend visting, and I will try my best to show her some of the Boston nightlife (oh, I'm <em>such</em> the expert there). Should be fun :).\r\n\r\nOh, I threw up some <a href=\"http://flickr.com/photos/timmfin/sets/804418/\">photos</a> of last weekend on my brand-spanking new <a href=\"http://www.flickr.com/\">Flickr</a> account. I guess I finally got around to jumping on the Flickr hype. I was even motivated enough to try and sort through all of my road trip pictures, but despite my best attempts to upload pics with <a href=\"http://glimmr.sourceforge.net/\">Glimmr</a>, <a href=\"http://www.gnome.org/projects/f-spot/\">F-Spot</a>, and a <a href=\"http://berserk.org/uploadr/\">python script</a> I never succeeded. Must be something with my account or settings... erg, oh well.",
  "post_title": "Oh, how time flies...",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "oh-how-time-flies",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-08-25 23:11:43",
  "post_modified_gmt": "2005-08-26 04:11:43",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=119",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "5"
}
