{
  "ID": "101",
  "post_author": "130",
  "post_date": "2005-05-25 01:30:42",
  "post_date_gmt": "2005-05-25 06:30:42",
  "post_content": "\r\n<p>I must be an odd sort of blogger in order to not be motivated to write about one of the most important events to happen so far in my life (but I will attempt to anyways since I think I should)...</p>\r\n\r\n<p>So I've graduated. Well, at least that is what the university has told me since I still have no diploma in my hand. It has been <span style=\"text-decoration: line-through;\">rather interesting</span> expected that graduation was anti-climactic. But aren't I supposed to be excited to be done with school? Or, shouldn't I at least be somewhat saddened that I'm leaving my college friends and experiences (even more so since I'm moving to Mass.)?</p>\r\n\r\n<p>But the fact is that I am neither. Sure I am happy to have finished my undergraduate studies, but ya know college was a fun thing. And not only due to the social aspects, but since it was an environment where I could focus on learning. You may think that this is sad, but I truly enjoyed taking classes, listening to lectures, participating in discussions, and working on projects (though honestly I could have done without the group projects). I'm not trying to hide the fact that I was often unmotivated and disinterested for much of the work I had to do, but overall I would have to say that the classes I have taken and the work that I have done for them has been a wonderfully enriching experience. So instead of being one of those students searching for a reason to skip class, I felt motivated (though sometimes only obligated) to go. In fact, I think that the only three classes I missed in college (that I remember) were due to sleeping in 30 mins into class once, leaving class since I was too sick to pay attention, and missing class since I got hit by a car. But I digress...</p>\r\n\r\n<p>So college was a good thing and I should be sad to leave it right? Well, not really. It was a good thing but it is time to move on. Its time to take the new person I have shaped into and do something with it. Academic pursuit is a wonderful thing, but it does not bear much fruit by itself. For me this pursuit starts off with a career at IBM. So on to the next question, shouldn't I be excited to enter the real world, truly earn my own living, and begin to be able to accomplish something? Well, yes and no. I am excited about the opportunity, but at the same time I am quite aware that it is nothing particular special in of itself. By this I mean that I am not merely excited about the job cause its a job, or even a job with IBM. If I am excited about anything I am excited about the ideas and technologies that I'll be working with and the interesting things they may lead to in the future. Sure it helps (quite a lot actually) to be with a company such as IBM that has the resources, recognition, and ability to work in these areas and cause significant and worthy change, but my excitement does not stem from the reputation or money as most would expect.</p>\r\n\r\n<p>Won't I be saddened to be \"leaving\" the friends I've made in college? Now this is a tough question and I hope to not to hurt anyone's feelings, but I'll be honest. I certainly will miss many people and the fun memories that I've had with them. But the thing about me is that I'm really an independent person. Some may look at me and think that I'm more of a anti-social hermit and others may say that I'm an extroverted person hiding behind a shy face, but either way I tend to not get as connected to people as others. Even if I try to keep up with people on IM, facebook, email, phone, etc I know that I will forget as time goes on. I'm just bad about those sort of things. But one thing to note is that I'm not forgetting about you as a person at all, and I'm by no means losing any appreciation for the friendship that I had with you. Its just that I honestly don't often think about communicating with others. It doesn't occur to me to check in on a person very often. I tend to live my life in the present, not worrying too much about the future, and not too often revisiting the past. Maybe I'm just a selfish person, or maybe I'm missing part of my brain that is supposed to make me wonder about other people (though I hope the real reasoning is something other than those two extremes). It's a good thing that this has started to change somewhat, and I think that I'm better at keeping tabs that I used to be, but still far from \"normal\". So what I'm trying to say is please don't be too upset if I don't talk to you as much as you think I should. I'm not trying to make an excuse to rationalize my behavior and I really hope that this is not coming off that way. The simple truth is my friends will probably have to put more effort into communication than myself in order to just maintain a relationship. Maybe this is okay with you, and maybe it isn't, but I think its better for me to say it than to make you find out.</p>",
  "post_title": "Graduation...",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "graduation",
  "to_ping": "",
  "pinged": "\nArray\n\n",
  "post_modified": "2005-05-25 01:36:51",
  "post_modified_gmt": "2005-05-25 06:36:51",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=101",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "2"
}
