{
  "ID": "67",
  "post_author": "130",
  "post_date": "2005-01-26 16:48:18",
  "post_date_gmt": "2005-01-26 21:48:18",
  "post_content": "Last weekend I was at Snowshoe mountain with a bunch of my UMD/church friends (none of them go to UMD anymore since they've graduated. I'm the youngest of the group). Skiing/snowboarding was great, conditions were good, most of the slopes were open, I actually didn't hurt myself (I'm a rather reckless skier). The only downside to the weekend was the first night when I -- well... <em>somehow</em> my car ended up in the ditch :(.\r\n\r\nOk, so I have somewhat of an excuse. I was trying to get up our snow-covered driveway and didn't make it all the way, so I was backing back down. When coming back down I didn't notice the drainage ditch and associated rusted and sharp metal drainage pipe behind me (it was somewhat hidden by a layer of snow), and proceeded to drive right into it. Bummer.\r\n\r\nTo make a long story shorter, we had 6-7 guys try to push it out, we took some cheap rope and tried to make a makeshift tow rope, and then waited an hour or so for a tow-truck. Eventually we (and by we I mean the tow-truck), got it out. Then, I had to change the slashed and flatten front tire. I tried to call around to see where in West Virginia I could get a new tire, but I couldn't find a place within 75 miles that carries tires for my TSX. After talking to the Accra roadside assistance people to find out that the \"donut\" spare is rated for 30,000 miles (only going under 50mph) I decided to drive home and deal with it then. Thankfully the drive home was uneventful, though it ended up taking an additional hour or two since I couldn't go over 50mph.\r\n\r\nI'm probably making this seem much worse than it was. It really wasn't such a big deal and I'm thankful that nothing worse happened. I'm glad I was with friends helped me laugh about it and still continue to have a fun time.\r\n\r\n<em>Note: White car + West Virginia = very dirty car</em>\r\n",
  "post_title": "UMD Skiing 2005",
  "post_category": "1",
  "post_excerpt": "",
  "post_lat": null,
  "post_lon": null,
  "post_status": "publish",
  "comment_status": "open",
  "ping_status": "open",
  "post_password": "",
  "post_name": "umd-skiing-2005",
  "to_ping": "",
  "pinged": "",
  "post_modified": "2005-01-28 19:27:01",
  "post_modified_gmt": "2005-01-29 00:27:01",
  "post_content_filtered": "",
  "post_parent": "0",
  "guid": "http://www.timmfin.net/?p=67",
  "menu_order": "0",
  "post_type": "post",
  "post_mime_type": "",
  "comment_count": "4"
}
